﻿//**********************************************************************
//**********************************************************************
//**                                                                  **
//**        (C)Copyright 1985-2019, American Megatrends, Inc.         **
//**                                                                  **
//**                       All Rights Reserved.                       **
//**                                                                  **
//**      5555 Oakbrook Parkway, Suite 200, Norcross, GA 30093        **
//**                                                                  **
//**                       Phone: (770)-246-8600                      **
//**                                                                  **
//***********************************************f***********************
//**********************************************************************
//**********************************************************************
//<AMI_FHDR_START>
//
// Name:  <IT8625HwmSetup.uni>
//
// Description: HWM form string definitions.
//
//<AMI_FHDR_END>
//**********************************************************************
/=#
#include "VFR.uni"
#ifndef x-UEFI-AMI
#langdef   x-UEFI-AMI "x-UEFI-AMI"    // AMI Configuration Language
#endif
//If customer define the common logical device by themselves, add here.

//
// HardWare Monitor 
//
#string STR_IT8625_HMM_CONFIGURATION                    #language eng "Hardware Monitor"
#string STR_IT8625_HMM_CONFIGURATION_HELP               #language eng "Monitor hardware status"

#string STR_PC_HEALTH                                   #language eng "Pc Health Status"
#string STR_HWM_CPU_DTS                                 #language eng "CPU DTS Temperature"
#string STR_HWM_CPU_DTS_VALUE                           #language eng "N/A"
#string STR_IT8625_HMM_VIN0                             #language eng "VIN0"
#string STR_IT8625_HMM_VIN0_VALUE                       #language eng "N/A"
#string STR_IT8625_FAN1_SETTING                         #language eng "Fan 1 Setting"
#string STR_IT8625_FAN2_SETTING                         #language eng "Fan 2 Setting"
#string STR_IT8625_FAN3_SETTING                         #language eng "Fan 3 Setting"
#string STR_IT8625_FAN4_SETTING                         #language eng "Fan 4 Setting"
#string STR_IT8625_FAN5_SETTING                         #language eng "Fan 5 Setting"
#string STR_IT8625_FAN6_SETTING                         #language eng "Fan 6 Setting"

#string STR_IT8625_SMF_CONFIGURATION                    #language eng "Smart Fan Function"
#string STR_IT8625_SMF_CONFIGURATION_HELP               #language eng "Smart Fan function setting"
#string STR_IT8625_SMARTFAN1_CONFIG                     #language eng "Smart Fan 1 Mode"            
                                                        #language x-UEFI-AMI "YSIO300"
#string STR_IT8625_SMARTFAN2_CONFIG                     #language eng "Smart Fan 2 Mode"
                                                        #language x-UEFI-AMI "YSIO301"
#string STR_IT8625_SMARTFAN3_CONFIG                     #language eng "Smart Fan 3 Mode"
                                                        #language x-UEFI-AMI "YSIO302"
#string STR_IT8625_SMARTFAN4_CONFIG                     #language eng "Smart Fan 4 Mode"
                                                        #language x-UEFI-AMI "YSIO303"
#string STR_IT8625_SMARTFAN5_CONFIG                     #language eng "Smart Fan 5 Mode"
                                                        #language x-UEFI-AMI "YSIO304"
#string STR_IT8625_SMARTFAN6_CONFIG                     #language eng "Smart Fan 6 Mode"
                                                        #language x-UEFI-AMI "YSIO305"
#string STR_IT8625_SMARTFAN_CONFIG_HELP                 #language eng "Smart Fan Mode Select"
#string STR_IT8625_SMARTFAN_MODE0                       #language eng "Software Mode"
#string STR_IT8625_SMARTFAN_MODE1                       #language eng "Automatic Mode"
#string STR_IT8625_FAN1_PWM_CONTROL                     #language eng "Manual PWM Setting"
                                                        #language x-UEFI-AMI "YSIO306"
#string STR_IT8625_FAN2_PWM_CONTROL                     #language eng "Manual PWM Setting"
                                                        #language x-UEFI-AMI "YSIO307"
#string STR_IT8625_FAN3_PWM_CONTROL                     #language eng "Manual PWM Setting"
                                                        #language x-UEFI-AMI "YSIO308"
#string STR_IT8625_FAN4_PWM_CONTROL                     #language eng "Manual PWM Setting"
                                                        #language x-UEFI-AMI "YSIO309"
#string STR_IT8625_FAN5_PWM_CONTROL                     #language eng "Manual PWM Setting"
                                                        #language x-UEFI-AMI "YSIO30A"
#string STR_IT8625_FAN6_PWM_CONTROL                     #language eng "Manual PWM Setting"
                                                        #language x-UEFI-AMI "YSIO30B"
#string STR_IT8625_FAN_PWM_CONTROL_HELP                 #language eng "Fan will work with this Manual PWM Value"
#string STR_IT8625_FAN1_TYPE                            #language eng "Fan 1 Type"
                                                        #language x-UEFI-AMI "YSIO30C"
#string STR_IT8625_FAN2_TYPE                            #language eng "Fan 2 Type"
                                                        #language x-UEFI-AMI "YSIO30D"
#string STR_IT8625_FAN3_TYPE                            #language eng "Fan 3 Type"
                                                        #language x-UEFI-AMI "YSIO30E"
#string STR_IT8625_FAN4_TYPE                            #language eng "Fan 4 Type"
                                                        #language x-UEFI-AMI "YSIO30F"
#string STR_IT8625_FAN5_TYPE                            #language eng "Fan 5 Type"
                                                        #language x-UEFI-AMI "YSIO310"
#string STR_IT8625_FAN6_TYPE                            #language eng "Fan 6 Type"
                                                        #language x-UEFI-AMI "YSIO311"
#string STR_IT8625_FAN_TYPE_HELP                        #language eng "Select fan type RPM/PWM"
#string STR_IT8625_FAN_TYPE0                            #language eng "PWM"
#string STR_IT8625_FAN_TYPE1                            #language eng "RPM"
#string STR_IT8625_FAN1_TEMP_IN                         #language eng "Temperature select"
                                                        #language x-UEFI-AMI "YSIO312"
#string STR_IT8625_FAN2_TEMP_IN                         #language eng "Temperature select"
                                                        #language x-UEFI-AMI "YSIO313"
#string STR_IT8625_FAN3_TEMP_IN                         #language eng "Temperature select"
                                                        #language x-UEFI-AMI "YSIO314"
#string STR_IT8625_FAN4_TEMP_IN                         #language eng "Temperature select"
                                                        #language x-UEFI-AMI "YSIO315"
#string STR_IT8625_FAN5_TEMP_IN                         #language eng "Temperature select"
                                                        #language x-UEFI-AMI "YSIO316"
#string STR_IT8625_FAN6_TEMP_IN                         #language eng "Temperature select"
                                                        #language x-UEFI-AMI "YSIO317"
#string STR_IT8625_TEMP_IN_HELP                         #language eng "temperature input selection"
#string STR_IT8625_FAN1_OFF_LIMIT_TEMP                  #language eng "Fan off temperature limit"
                                                        #language x-UEFI-AMI "YSIO318"
#string STR_IT8625_FAN2_OFF_LIMIT_TEMP                  #language eng "Fan off temperature limit"
                                                        #language x-UEFI-AMI "YSIO319"
#string STR_IT8625_FAN3_OFF_LIMIT_TEMP                  #language eng "Fan off temperature limit"
                                                        #language x-UEFI-AMI "YSIO31A"
#string STR_IT8625_FAN4_OFF_LIMIT_TEMP                  #language eng "Fan off temperature limit"
                                                        #language x-UEFI-AMI "YSIO31B"
#string STR_IT8625_FAN5_OFF_LIMIT_TEMP                  #language eng "Fan off temperature limit"
                                                        #language x-UEFI-AMI "YSIO31C"
#string STR_IT8625_FAN6_OFF_LIMIT_TEMP                  #language eng "Fan off temperature limit"
                                                        #language x-UEFI-AMI "YSIO31D"
#string STR_IT8625_OFF_LIMIT_TEMP_HELP                  #language eng "Fan will off when temperature lower than this limit"
#string STR_IT8625_FAN1_START_LIMIT_TEMP                #language eng "Fan start temperature limit"
                                                        #language x-UEFI-AMI "YSIO31E"
#string STR_IT8625_FAN2_START_LIMIT_TEMP                #language eng "Fan start temperature limit"
                                                        #language x-UEFI-AMI "YSIO31F"
#string STR_IT8625_FAN3_START_LIMIT_TEMP                #language eng "Fan start temperature limit"
                                                        #language x-UEFI-AMI "YSIO320"
#string STR_IT8625_FAN4_START_LIMIT_TEMP                #language eng "Fan start temperature limit"
                                                        #language x-UEFI-AMI "YSIO321"
#string STR_IT8625_FAN5_START_LIMIT_TEMP                #language eng "Fan start temperature limit"
                                                        #language x-UEFI-AMI "YSIO322"
#string STR_IT8625_FAN6_START_LIMIT_TEMP                #language eng "Fan start temperature limit"
                                                        #language x-UEFI-AMI "YSIO323"
#string STR_IT8625_START_LIMIT_TEMP_HELP                #language eng "Fan will work when temperature higher than this limit"
#string STR_IT8625_FAN1_FULL_SPEED_LIMIT_TEMP           #language eng "Fan full speed temperature limit"
                                                        #language x-UEFI-AMI "YSIO324"
#string STR_IT8625_FAN2_FULL_SPEED_LIMIT_TEMP           #language eng "Fan full speed temperature limit"
                                                        #language x-UEFI-AMI "YSIO325"
#string STR_IT8625_FAN3_FULL_SPEED_LIMIT_TEMP           #language eng "Fan full speed temperature limit"
                                                        #language x-UEFI-AMI "YSIO326"
#string STR_IT8625_FAN4_FULL_SPEED_LIMIT_TEMP           #language eng "Fan full speed temperature limit"
                                                        #language x-UEFI-AMI "YSIO327"
#string STR_IT8625_FAN5_FULL_SPEED_LIMIT_TEMP           #language eng "Fan full speed temperature limit"
                                                        #language x-UEFI-AMI "YSIO328"
#string STR_IT8625_FAN6_FULL_SPEED_LIMIT_TEMP           #language eng "Fan full speed temperature limit"
                                                        #language x-UEFI-AMI "YSIO329"
#string STR_IT8625_FULL_SPEED_LIMIT_TEMP_HELP           #language eng "Fan will full speed when temperature higher than this limit"
#string STR_IT8625_FAN1_START_PWM                       #language eng "Fan start PWM"
                                                        #language x-UEFI-AMI "YSIO32A"
#string STR_IT8625_FAN2_START_PWM                       #language eng "Fan start PWM"
                                                        #language x-UEFI-AMI "YSIO32B"
#string STR_IT8625_FAN3_START_PWM                       #language eng "Fan start PWM"
                                                        #language x-UEFI-AMI "YSIO32C"
#string STR_IT8625_FAN4_START_PWM                       #language eng "Fan start PWM"
                                                        #language x-UEFI-AMI "YSIO32D"
#string STR_IT8625_FAN5_START_PWM                       #language eng "Fan start PWM"
                                                        #language x-UEFI-AMI "YSIO32E"
#string STR_IT8625_FAN6_START_PWM                       #language eng "Fan start PWM"
                                                        #language x-UEFI-AMI "YSIO32F"
#string STR_IT8625_START_PWM_HELP                       #language eng "Fan will stat with this PWM value."
#string STR_IT8625_FAN1_START_RPM                       #language eng "Fan start RPM"
                                                        #language x-UEFI-AMI "YSIO330"
#string STR_IT8625_FAN2_START_RPM                       #language eng "Fan start RPM"
                                                        #language x-UEFI-AMI "YSIO331"
#string STR_IT8625_FAN3_START_RPM                       #language eng "Fan start RPM"
                                                        #language x-UEFI-AMI "YSIO332"
#string STR_IT8625_FAN4_START_RPM                       #language eng "Fan start RPM"
                                                        #language x-UEFI-AMI "YSIO333"
#string STR_IT8625_FAN5_START_RPM                       #language eng "Fan start RPM"
                                                        #language x-UEFI-AMI "YSIO334"
#string STR_IT8625_FAN6_START_RPM                       #language eng "Fan start RPM"
                                                        #language x-UEFI-AMI "YSIO335"
#string STR_IT8625_START_RPM_HELP                       #language eng "Fan will stat with this RPM value."
#string STR_IT8625_FAN1_PWM_SLOPE_CONFIG                #language eng "PWM SLOPE SETTING"
                                                        #language x-UEFI-AMI "YSIO336"
#string STR_IT8625_FAN2_PWM_SLOPE_CONFIG                #language eng "PWM SLOPE SETTING"
                                                        #language x-UEFI-AMI "YSIO337"
#string STR_IT8625_FAN3_PWM_SLOPE_CONFIG                #language eng "PWM SLOPE SETTING"
                                                        #language x-UEFI-AMI "YSIO338"
#string STR_IT8625_FAN4_PWM_SLOPE_CONFIG                #language eng "PWM SLOPE SETTING"
                                                        #language x-UEFI-AMI "YSIO339"
#string STR_IT8625_FAN5_PWM_SLOPE_CONFIG                #language eng "PWM SLOPE SETTING"
                                                        #language x-UEFI-AMI "YSIO33A"
#string STR_IT8625_FAN6_PWM_SLOPE_CONFIG                #language eng "PWM SLOPE SETTING"
                                                        #language x-UEFI-AMI "YSIO33B"
#string STR_IT8625_PWM_SLOPE_CONFIG_HELP                #language eng "PWM SLOPE Selection\nSlope = PWM value/℃"
#string STR_IT8625_FAN1_RPM_SLOPE_CONFIG                #language eng "RPM SLOPE SETTING"
                                                        #language x-UEFI-AMI "YSIO33C"
#string STR_IT8625_FAN2_RPM_SLOPE_CONFIG                #language eng "RPM SLOPE SETTING"
                                                        #language x-UEFI-AMI "YSIO33D"
#string STR_IT8625_FAN3_RPM_SLOPE_CONFIG                #language eng "RPM SLOPE SETTING"
                                                        #language x-UEFI-AMI "YSIO33E"
#string STR_IT8625_FAN4_RPM_SLOPE_CONFIG                #language eng "RPM SLOPE SETTING"
                                                        #language x-UEFI-AMI "YSIO33F"
#string STR_IT8625_FAN5_RPM_SLOPE_CONFIG                #language eng "RPM SLOPE SETTING"
                                                        #language x-UEFI-AMI "YSIO340"
#string STR_IT8625_FAN6_RPM_SLOPE_CONFIG                #language eng "RPM SLOPE SETTING"
                                                        #language x-UEFI-AMI "YSIO341"
#string STR_IT8625_RPM_SLOPE_CONFIG_HELP                #language eng "Slope of target RPM"
#string STR_IT8625_FAN1_TARGET_ZONE                     #language eng "Target Zone"
                                                        #language x-UEFI-AMI "YSIO342"
#string STR_IT8625_FAN2_TARGET_ZONE                     #language eng "Target Zone"
                                                        #language x-UEFI-AMI "YSIO343"
#string STR_IT8625_FAN3_TARGET_ZONE                     #language eng "Target Zone"
                                                        #language x-UEFI-AMI "YSIO344"
#string STR_IT8625_FAN4_TARGET_ZONE                     #language eng "Target Zone"
                                                        #language x-UEFI-AMI "YSIO345"
#string STR_IT8625_FAN5_TARGET_ZONE                     #language eng "Target Zone"
                                                        #language x-UEFI-AMI "YSIO346"
#string STR_IT8625_FAN6_TARGET_ZONE                     #language eng "Target Zone"
                                                        #language x-UEFI-AMI "YSIO347"
#string STR_IT8625_TARGET_ZONE_HELP                     #language eng "Target zone boundary"
#string STR_IT8625_FAN1_TEMP_INTERVAL                   #language eng "△ Temperature"
                                                        #language x-UEFI-AMI "YSIO348"
#string STR_IT8625_FAN2_TEMP_INTERVAL                   #language eng "△ Temperature"
                                                        #language x-UEFI-AMI "YSIO349"
#string STR_IT8625_FAN3_TEMP_INTERVAL                   #language eng "△ Temperature"
                                                        #language x-UEFI-AMI "YSIO34A"
#string STR_IT8625_FAN4_TEMP_INTERVAL                   #language eng "△ Temperature"
                                                        #language x-UEFI-AMI "YSIO34B"
#string STR_IT8625_FAN5_TEMP_INTERVAL                   #language eng "△ Temperature"
                                                        #language x-UEFI-AMI "YSIO34C"
#string STR_IT8625_FAN6_TEMP_INTERVAL                   #language eng "△ Temperature"
                                                        #language x-UEFI-AMI "YSIO34D"
#string STR_IT8625_TEMP_INTERVAL_HELP                   #language eng "Temperature Interval"
#string STR_IT8625_FAN1_SMOOTH                          #language eng "Smoothing control"
                                                        #language x-UEFI-AMI "YSIO34E"
#string STR_IT8625_FAN2_SMOOTH                          #language eng "Smoothing control"
                                                        #language x-UEFI-AMI "YSIO34F"
#string STR_IT8625_FAN3_SMOOTH                          #language eng "Smoothing control"
                                                        #language x-UEFI-AMI "YSIO350"
#string STR_IT8625_FAN4_SMOOTH                          #language eng "Smoothing control"
                                                        #language x-UEFI-AMI "YSIO351"
#string STR_IT8625_FAN5_SMOOTH                          #language eng "Smoothing control"
                                                        #language x-UEFI-AMI "YSIO352"
#string STR_IT8625_FAN6_SMOOTH                          #language eng "Smoothing control"
                                                        #language x-UEFI-AMI "YSIO353"
#string STR_IT8625_SMOOTH_HELP                          #language eng "Smoothing frequency selection"
#string STR_IT8625_FAN1_CURVE_COUNT                     #language eng "Fan curve count"
                                                        #language x-UEFI-AMI "YSIO354"
#string STR_IT8625_FAN2_CURVE_COUNT                     #language eng "Fan curve count"
                                                        #language x-UEFI-AMI "YSIO355"
#string STR_IT8625_FAN3_CURVE_COUNT                     #language eng "Fan curve count"
                                                        #language x-UEFI-AMI "YSIO356"
#string STR_IT8625_FAN4_CURVE_COUNT                     #language eng "Fan curve count"
                                                        #language x-UEFI-AMI "YSIO357"
#string STR_IT8625_FAN5_CURVE_COUNT                     #language eng "Fan curve count"
                                                        #language x-UEFI-AMI "YSIO358"
#string STR_IT8625_FAN6_CURVE_COUNT                     #language eng "Fan curve count"
                                                        #language x-UEFI-AMI "YSIO359"
#string STR_IT8625_CURVE_COUNT_HELP                     #language eng "Fan curve count"
#string STR_IT8625_FAN_EXTRA_A_SETTING                  #language eng "Extra curve A setting"
#string STR_IT8625_FAN1_A_VECTOR_START_LIMIT            #language eng "Ex-Start Limit"
                                                        #language x-UEFI-AMI "YSIO35A"
#string STR_IT8625_FAN2_A_VECTOR_START_LIMIT            #language eng "Ex-Start Limit"
                                                        #language x-UEFI-AMI "YSIO35B"
#string STR_IT8625_FAN3_A_VECTOR_START_LIMIT            #language eng "Ex-Start Limit"
                                                        #language x-UEFI-AMI "YSIO35C"
#string STR_IT8625_FAN4_A_VECTOR_START_LIMIT            #language eng "Ex-Start Limit"
                                                        #language x-UEFI-AMI "YSIO35D"
#string STR_IT8625_FAN5_A_VECTOR_START_LIMIT            #language eng "Ex-Start Limit"
                                                        #language x-UEFI-AMI "YSIO35F"
#string STR_IT8625_FAN6_A_VECTOR_START_LIMIT            #language eng "Ex-Start Limit"
                                                        #language x-UEFI-AMI "YSIO360"
#string STR_IT8625_EXTRA_VECTOR_START_LIMIT_HELP        #language eng "Extra vector start limit"
#string STR_IT8625_FAN1_A_VECTOR_TEMP_IN                #language eng "Ex-Temperature select"
                                                        #language x-UEFI-AMI "YSIO361"
#string STR_IT8625_FAN2_A_VECTOR_TEMP_IN                #language eng "Ex-Temperature select"
                                                        #language x-UEFI-AMI "YSIO362"
#string STR_IT8625_FAN3_A_VECTOR_TEMP_IN                #language eng "Ex-Temperature select"
                                                        #language x-UEFI-AMI "YSIO363"
#string STR_IT8625_FAN4_A_VECTOR_TEMP_IN                #language eng "Ex-Temperature select"
                                                        #language x-UEFI-AMI "YSIO364"
#string STR_IT8625_FAN5_A_VECTOR_TEMP_IN                #language eng "Ex-Temperature select"
                                                        #language x-UEFI-AMI "YSIO365"
#string STR_IT8625_FAN6_A_VECTOR_TEMP_IN                #language eng "Ex-Temperature select"
                                                        #language x-UEFI-AMI "YSIO366"
#string STR_IT8625_EXTRA_VECTOR_TEMP_IN_HELP            #language eng "Extra curve temperature select"
#string STR_IT8625_FAN1_A_VECTOR_SLOPE_TYPE             #language eng "Slope Type"
                                                        #language x-UEFI-AMI "YSIO367"
#string STR_IT8625_FAN2_A_VECTOR_SLOPE_TYPE             #language eng "Slope Type"
                                                        #language x-UEFI-AMI "YSIO368"
#string STR_IT8625_FAN3_A_VECTOR_SLOPE_TYPE             #language eng "Slope Type"
                                                        #language x-UEFI-AMI "YSIO369"
#string STR_IT8625_FAN4_A_VECTOR_SLOPE_TYPE             #language eng "Slope Type"
                                                        #language x-UEFI-AMI "YSIO36A"
#string STR_IT8625_FAN5_A_VECTOR_SLOPE_TYPE             #language eng "Slope Type"
                                                        #language x-UEFI-AMI "YSIO36B"
#string STR_IT8625_FAN6_A_VECTOR_SLOPE_TYPE             #language eng "Slope Type"
                                                        #language x-UEFI-AMI "YSIO36C"
#string STR_IT8625_EXTRA_VECTOR_SLOPE_TYPE_HELP         #language eng "Slope is postive or negative"
#string STR_IT8625_FAN1_A_VECTOR_RANGE                  #language eng "Range Selection"
                                                        #language x-UEFI-AMI "YSIO36D"
#string STR_IT8625_FAN2_A_VECTOR_RANGE                  #language eng "Range Selection"
                                                        #language x-UEFI-AMI "YSIO36E"
#string STR_IT8625_FAN3_A_VECTOR_RANGE                  #language eng "Range Selection"
                                                        #language x-UEFI-AMI "YSIO36F"
#string STR_IT8625_FAN4_A_VECTOR_RANGE                  #language eng "Range Selection"
                                                        #language x-UEFI-AMI "YSIO370"
#string STR_IT8625_FAN5_A_VECTOR_RANGE                  #language eng "Range Selection"
                                                        #language x-UEFI-AMI "YSIO371"
#string STR_IT8625_FAN6_A_VECTOR_RANGE                  #language eng "Range Selection"
                                                        #language x-UEFI-AMI "YSIO372"
#string STR_IT8625_EXTRA_VECTOR_RANGE_HELP              #language eng "These bits determine the extra vector range after the temperature limit."
#string STR_IT8625_FAN1_A_VECTOR_SLOPE                  #language eng "Ex-Slope Value"
                                                        #language x-UEFI-AMI "YSIO373"
#string STR_IT8625_FAN2_A_VECTOR_SLOPE                  #language eng "Ex-Slope Value"
                                                        #language x-UEFI-AMI "YSIO374"
#string STR_IT8625_FAN3_A_VECTOR_SLOPE                  #language eng "Ex-Slope Value"
                                                        #language x-UEFI-AMI "YSIO375"
#string STR_IT8625_FAN4_A_VECTOR_SLOPE                  #language eng "Ex-Slope Value"
                                                        #language x-UEFI-AMI "YSIO376"
#string STR_IT8625_FAN5_A_VECTOR_SLOPE                  #language eng "Ex-Slope Value"
                                                        #language x-UEFI-AMI "YSIO377"
#string STR_IT8625_FAN6_A_VECTOR_SLOPE                  #language eng "Ex-Slope Value"
                                                        #language x-UEFI-AMI "YSIO378"
#string STR_IT8625_EXTRA_VECTOR_SLOPE_HELP              #language eng "These bits determine the extra vector slope"
#string STR_IT8625_FAN_EXTRA_B_SETTING                  #language eng "Extra curve B setting"
#string STR_IT8625_FAN1_B_VECTOR_START_LIMIT            #language eng "Ex-Start Limit"
                                                        #language x-UEFI-AMI "YSIO379"
#string STR_IT8625_FAN2_B_VECTOR_START_LIMIT            #language eng "Ex-Start Limit"
                                                        #language x-UEFI-AMI "YSIO37A"
#string STR_IT8625_FAN3_B_VECTOR_START_LIMIT            #language eng "Ex-Start Limit"
                                                        #language x-UEFI-AMI "YSIO37B"
#string STR_IT8625_FAN4_B_VECTOR_START_LIMIT            #language eng "Ex-Start Limit"
                                                        #language x-UEFI-AMI "YSIO37C"
#string STR_IT8625_FAN5_B_VECTOR_START_LIMIT            #language eng "Ex-Start Limit"
                                                        #language x-UEFI-AMI "YSIO37D"
#string STR_IT8625_FAN6_B_VECTOR_START_LIMIT            #language eng "Ex-Start Limit"
                                                        #language x-UEFI-AMI "YSIO37E"
#string STR_IT8625_FAN1_B_VECTOR_TEMP_IN                #language eng "Ex-Temperature select"
                                                        #language x-UEFI-AMI "YSIO37F"
#string STR_IT8625_FAN2_B_VECTOR_TEMP_IN                #language eng "Ex-Temperature select"
                                                        #language x-UEFI-AMI "YSIO380"
#string STR_IT8625_FAN3_B_VECTOR_TEMP_IN                #language eng "Ex-Temperature select"
                                                        #language x-UEFI-AMI "YSIO381"
#string STR_IT8625_FAN4_B_VECTOR_TEMP_IN                #language eng "Ex-Temperature select"
                                                        #language x-UEFI-AMI "YSIO382"
#string STR_IT8625_FAN5_B_VECTOR_TEMP_IN                #language eng "Ex-Temperature select"
                                                        #language x-UEFI-AMI "YSIO383"
#string STR_IT8625_FAN6_B_VECTOR_TEMP_IN                #language eng "Ex-Temperature select"
                                                        #language x-UEFI-AMI "YSIO384"
#string STR_IT8625_FAN1_B_VECTOR_SLOPE_TYPE             #language eng "Slope Type"
                                                        #language x-UEFI-AMI "YSIO385"
#string STR_IT8625_FAN2_B_VECTOR_SLOPE_TYPE             #language eng "Slope Type"
                                                        #language x-UEFI-AMI "YSIO386"
#string STR_IT8625_FAN3_B_VECTOR_SLOPE_TYPE             #language eng "Slope Type"
                                                        #language x-UEFI-AMI "YSIO387"
#string STR_IT8625_FAN4_B_VECTOR_SLOPE_TYPE             #language eng "Slope Type"
                                                        #language x-UEFI-AMI "YSIO388"
#string STR_IT8625_FAN5_B_VECTOR_SLOPE_TYPE             #language eng "Slope Type"
                                                        #language x-UEFI-AMI "YSIO389"
#string STR_IT8625_FAN6_B_VECTOR_SLOPE_TYPE             #language eng "Slope Type"
                                                        #language x-UEFI-AMI "YSIO38A"
#string STR_IT8625_FAN1_B_VECTOR_RANGE                  #language eng "Range Selection"
                                                        #language x-UEFI-AMI "YSIO38B"
#string STR_IT8625_FAN2_B_VECTOR_RANGE                  #language eng "Range Selection"
                                                        #language x-UEFI-AMI "YSIO38C"
#string STR_IT8625_FAN3_B_VECTOR_RANGE                  #language eng "Range Selection"
                                                        #language x-UEFI-AMI "YSIO38D"
#string STR_IT8625_FAN4_B_VECTOR_RANGE                  #language eng "Range Selection"
                                                        #language x-UEFI-AMI "YSIO38E"
#string STR_IT8625_FAN5_B_VECTOR_RANGE                  #language eng "Range Selection"
                                                        #language x-UEFI-AMI "YSIO38F"
#string STR_IT8625_FAN6_B_VECTOR_RANGE                  #language eng "Range Selection"
                                                        #language x-UEFI-AMI "YSIO390"
#string STR_IT8625_FAN1_B_VECTOR_SLOPE                  #language eng "Ex-Slope Value"
                                                        #language x-UEFI-AMI "YSIO391"
#string STR_IT8625_FAN2_B_VECTOR_SLOPE                  #language eng "Ex-Slope Value"
                                                        #language x-UEFI-AMI "YSIO392"
#string STR_IT8625_FAN3_B_VECTOR_SLOPE                  #language eng "Ex-Slope Value"
                                                        #language x-UEFI-AMI "YSIO393"
#string STR_IT8625_FAN4_B_VECTOR_SLOPE                  #language eng "Ex-Slope Value"
                                                        #language x-UEFI-AMI "YSIO394"
#string STR_IT8625_FAN5_B_VECTOR_SLOPE                  #language eng "Ex-Slope Value"
                                                        #language x-UEFI-AMI "YSIO395"
#string STR_IT8625_FAN6_B_VECTOR_SLOPE                  #language eng "Ex-Slope Value"
                                                        #language x-UEFI-AMI "YSIO396"
#string STR_IT8625_FAN_EXTRA_C_SETTING                  #language eng "Extra curve C setting"
#string STR_IT8625_FAN1_C_VECTOR_START_LIMIT            #language eng "Ex-Start Limit"
                                                        #language x-UEFI-AMI "YSIO397"
#string STR_IT8625_FAN2_C_VECTOR_START_LIMIT            #language eng "Ex-Start Limit"
                                                        #language x-UEFI-AMI "YSIO398"
#string STR_IT8625_FAN3_C_VECTOR_START_LIMIT            #language eng "Ex-Start Limit"
                                                        #language x-UEFI-AMI "YSIO399"
#string STR_IT8625_FAN4_C_VECTOR_START_LIMIT            #language eng "Ex-Start Limit"
                                                        #language x-UEFI-AMI "YSIO39A"
#string STR_IT8625_FAN5_C_VECTOR_START_LIMIT            #language eng "Ex-Start Limit"
                                                        #language x-UEFI-AMI "YSIO39B"
#string STR_IT8625_FAN6_C_VECTOR_START_LIMIT            #language eng "Ex-Start Limit"
                                                        #language x-UEFI-AMI "YSIO39C"
#string STR_IT8625_FAN1_C_VECTOR_TEMP_IN                #language eng "Ex-Temperature select"
                                                        #language x-UEFI-AMI "YSIO39D"
#string STR_IT8625_FAN2_C_VECTOR_TEMP_IN                #language eng "Ex-Temperature select"
                                                        #language x-UEFI-AMI "YSIO39E"
#string STR_IT8625_FAN3_C_VECTOR_TEMP_IN                #language eng "Ex-Temperature select"
                                                        #language x-UEFI-AMI "YSIO39F"
#string STR_IT8625_FAN4_C_VECTOR_TEMP_IN                #language eng "Ex-Temperature select"
                                                        #language x-UEFI-AMI "YSIO3A0"
#string STR_IT8625_FAN5_C_VECTOR_TEMP_IN                #language eng "Ex-Temperature select"
                                                        #language x-UEFI-AMI "YSIO3A1"
#string STR_IT8625_FAN6_C_VECTOR_TEMP_IN                #language eng "Ex-Temperature select"
                                                        #language x-UEFI-AMI "YSIO3A2"
#string STR_IT8625_FAN1_C_VECTOR_SLOPE_TYPE             #language eng "Slope Type"
                                                        #language x-UEFI-AMI "YSIO3A3"
#string STR_IT8625_FAN2_C_VECTOR_SLOPE_TYPE             #language eng "Slope Type"
                                                        #language x-UEFI-AMI "YSIO3A4"
#string STR_IT8625_FAN3_C_VECTOR_SLOPE_TYPE             #language eng "Slope Type"
                                                        #language x-UEFI-AMI "YSIO3A5"
#string STR_IT8625_FAN4_C_VECTOR_SLOPE_TYPE             #language eng "Slope Type"
                                                        #language x-UEFI-AMI "YSIO3A6"
#string STR_IT8625_FAN5_C_VECTOR_SLOPE_TYPE             #language eng "Slope Type"
                                                        #language x-UEFI-AMI "YSIO3A7"
#string STR_IT8625_FAN6_C_VECTOR_SLOPE_TYPE             #language eng "Slope Type"
                                                        #language x-UEFI-AMI "YSIO3A8"
#string STR_IT8625_FAN1_C_VECTOR_RANGE                  #language eng "Range Selection"
                                                        #language x-UEFI-AMI "YSIO3A9"
#string STR_IT8625_FAN2_C_VECTOR_RANGE                  #language eng "Range Selection"
                                                        #language x-UEFI-AMI "YSIO3AA"
#string STR_IT8625_FAN3_C_VECTOR_RANGE                  #language eng "Range Selection"
                                                        #language x-UEFI-AMI "YSIO3AB"
#string STR_IT8625_FAN4_C_VECTOR_RANGE                  #language eng "Range Selection"
                                                        #language x-UEFI-AMI "YSIO3AC"
#string STR_IT8625_FAN5_C_VECTOR_RANGE                  #language eng "Range Selection"
                                                        #language x-UEFI-AMI "YSIO3AD"
#string STR_IT8625_FAN6_C_VECTOR_RANGE                  #language eng "Range Selection"
                                                        #language x-UEFI-AMI "YSIO3AE"
#string STR_IT8625_FAN1_C_VECTOR_SLOPE                  #language eng "Ex-Slope Value"
                                                        #language x-UEFI-AMI "YSIO3AF"
#string STR_IT8625_FAN2_C_VECTOR_SLOPE                  #language eng "Ex-Slope Value"
                                                        #language x-UEFI-AMI "YSIO3B0"
#string STR_IT8625_FAN3_C_VECTOR_SLOPE                  #language eng "Ex-Slope Value"
                                                        #language x-UEFI-AMI "YSIO3B1"
#string STR_IT8625_FAN4_C_VECTOR_SLOPE                  #language eng "Ex-Slope Value"
                                                        #language x-UEFI-AMI "YSIO3B2"
#string STR_IT8625_FAN5_C_VECTOR_SLOPE                  #language eng "Ex-Slope Value"
                                                        #language x-UEFI-AMI "YSIO3B3"
#string STR_IT8625_FAN6_C_VECTOR_SLOPE                  #language eng "Ex-Slope Value"
                                                        #language x-UEFI-AMI "YSIO3B4"
#string STR_IT8625_SMOOTH_1HZ                           #language eng "1Hz"
#string STR_IT8625_SMOOTH_16HZ                          #language eng "16Hz"
#string STR_IT8625_SMOOTH_8HZ                           #language eng "8Hz"
#string STR_IT8625_SMOOTH_4HZ                           #language eng "4Hz"
#string STR_IT8625_TEMP_IN1                             #language eng "TMPIN1"
#string STR_IT8625_TEMP_IN2                             #language eng "TMPIN2"
#string STR_IT8625_TEMP_IN3                             #language eng "TMPIN3"
#string STR_IT8625_TEMP_IN4                             #language eng "TMPIN4"
#string STR_IT8625_TEMP_IN5                             #language eng "TMPIN5"
#string STR_IT8625_TEMP_IN6                             #language eng "TMPIN6"
#string STR_IT8625_SLOPE_TYPE_POSTIVE                   #language eng "Postive"
#string STR_IT8625_SLOPE_TYPE_NEGATIVE                  #language eng "Negative"
#string STR_IT8625_SMARTFAN_POLARITY                    #language eng "FAN_CTL Polarity"
#string STR_IT8625_SMARTFAN_POLARITY_HELP               #language eng "Set the Fan Control Polarity (for all FANs)"
#string STR_IT8625_SMARTFAN_LOW                         #language eng "Active low"
#string STR_IT8625_SMARTFAN_HIGH                        #language eng "Active high"

//**********************************************************************
//**********************************************************************
//**                                                                  **
//**        (C)Copyright 1985-2019, American Megatrends, Inc.         **
//**                                                                  **
//**                       All Rights Reserved.                       **
//**                                                                  **
//**      5555 Oakbrook Parkway, Suite 200, Norcross, GA 30093        **
//**                                                                  **
//**                       Phone: (770)-246-8600                      **
//**                                                                  **
//**********************************************************************
//**********************************************************************
